<template lang="pug">
table(width="100%" style="width: 100%; height: 100%; background-color: white;")
  tr
    td(height="100%")
      table(style="width: 100%; max-width: 600px; min-width: 600px; margin-left: auto; margin-right: auto; background-color:#F5F5F5")
        tr
          td(style="padding:24px")
            table(style="width: 100%; max-width: 552px; min-width: 552px; margin-left: auto; margin-right: auto; background-color:#FFFFFF")
              tr
                table(style="width:100%; height: 80px;")
                  tr
                    td
                      table(style="width: 100%; height: 178px")
                        tr
                          td
                            svg(width="552px" height="178px" viewBox="0 0 552 178" fill="none" xmlns="http://www.w3.org/2000/svg")
                              g(clip-path="url(#clip0_3633_48878)")
                                rect(width="552" height="178" rx="4" fill="#FF0141")
                                circle(cx="500.622" cy="7.78676" r="151.517" fill="#DE0039")
                                path(d="M107.392 -47.6937H264.424L160.662 74.7697H264.424L171.77 171.983L264.424 247.229H107.392V-47.6937Z" fill="#FFCCD0")
                                circle(cx="72.1895" cy="11.5179" r="72.1895" fill="#E90A43")
                                path(d="M285.058 69.7022H390.85L296.23 169.041L295.988 169.295L296.26 169.516L390.694 246.255H230.682V-56.1293H390.908L284.81 69.1681L284.358 69.7022H285.058Z" stroke="white" stroke-width="0.648894")
                                path(d="M229.06 -12.8156L229.06 74.2355L157.195 76.7318L229.06 -12.8156Z" fill="#DE0039")
                                path(d="M264.424 75.1092L220.462 120.369L211.053 75.1095L264.424 75.1092Z" fill="#FFCCD0")
                                circle(cx="411.237" cy="109.176" r="24.4957" stroke="white" stroke-width="0.648894")
                                circle(cx="51.9113" cy="95.063" r="6.16449" stroke="white" stroke-width="0.648894")
                                path(d="M232.953 -18.8179H285.189H343.59L232.953 42.0403V-18.8179Z" fill="#D10036")
                                path(d="M519.073 156.796L395.698 162.838L501.259 60.9083L501.562 60.6163L501.202 60.3977L387.488 -8.77549L574.127 -17.9155L588.52 276.006L401.617 285.159L519.328 157.34L519.864 156.758L519.073 156.796Z" fill="#FF0141" stroke="white" stroke-width="0.648894")
                                circle(cx="559.833" cy="12.1667" r="72.1895" fill="#FFCCD0")
                              defs
                                clipPath(id="clip0_3633_48878")
                                  rect(width="552" height="178" rx="4" fill="white")
              tr
                td(style="font-size: 18px;padding-right: 24px; padding-left: 24px; padding-top: 40px; padding-bottom: 40px;")
                  p Здравствуйте!
                  p Мы уже создали для Вас Личный кабинет, где Вы сможете посмотреть ознакомительный курс об Университете.
                  p Чтобы завершить регистрацию Личного кабинета, пройдите по ссылке, актуализируйте свои личные данные и задайте пароль.
                  p Нажмите для продолженения регистрации.
                  p Внимание! Ссылка действительна 12 часов
                  p После того, как вы завершите регистрацию, Личный кабинет будет доступен Вам по ссылке.
                  p Благодарим вас за доверие к Университету «Синергия» и желаем успехов в обучении!
              tr
                td
        tr
          td
            table(style="background-color:#252525; width:100%; height: 148px;")
              tr
                td
                  table(style="margin-left: auto; margin-right: auto; font-size: 13px; color: white;")
                    tr
                      td
                        table(style="margin-left: auto; margin-right: auto; font-size: 13px; color: white;")
                          tr 
                            td(style="padding-right: 16px")
                              svg(width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg")
                                path(d="M15.9998 2.66667C12.4636 2.66667 9.07223 4.07143 6.57175 6.57191C4.07126 9.0724 2.6665 12.4638 2.6665 16C2.6665 19.5362 4.07126 22.9276 6.57175 25.4281C9.07223 27.9286 12.4636 29.3333 15.9998 29.3333C19.5361 29.3333 22.9274 27.9286 25.4279 25.4281C27.9284 22.9276 29.3332 19.5362 29.3332 16C29.3332 12.4638 27.9284 9.0724 25.4279 6.57191C22.9274 4.07143 19.5361 2.66667 15.9998 2.66667Z" fill="#29B6F6")
                                path(d="M22.6332 10L20.1358 22.7507C20.1358 22.7507 20.0285 23.3333 19.3058 23.3333C18.9218 23.3333 18.7238 23.1507 18.7238 23.1507L13.3145 18.662L10.6678 17.328L7.27117 16.4247C7.27117 16.4247 6.6665 16.25 6.6665 15.75C6.6665 15.3333 7.2885 15.1347 7.2885 15.1347L21.4992 9.48933C21.4985 9.48866 21.9332 9.33266 22.2498 9.33333C22.4445 9.33333 22.6665 9.41666 22.6665 9.66666C22.6665 9.83333 22.6332 10 22.6332 10Z" fill="white")
                                path(d="M15.3334 20.3367L13.0494 22.586C13.0494 22.586 12.9501 22.6627 12.8174 22.666C12.7714 22.6673 12.7221 22.66 12.6714 22.6373L13.3141 18.6607L15.3334 20.3367Z" fill="#B0BEC5")
                                path(d="M19.9312 12.1307C19.8185 11.984 19.6105 11.9573 19.4638 12.0687L10.6665 17.3333C10.6665 17.3333 12.0705 21.2613 12.2845 21.9413C12.4992 22.622 12.6712 22.638 12.6712 22.638L13.3138 18.6613L19.8685 12.5973C20.0152 12.486 20.0425 12.2773 19.9312 12.1307Z" fill="#CFD8DC")
                            td(style="padding-right: 16px")
                              svg(width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg")
                                path(d="M28 24.6667C28 26.5333 26.5333 28 24.6667 28H7.33333C5.46667 28 4 26.5333 4 24.6667V7.33333C4 5.46667 5.46667 4 7.33333 4H24.6667C26.5333 4 28 5.46667 28 7.33333V24.6667Z" fill="#FF9800")
                                path(d="M17.9335 20.2667C18.9335 20.0667 19.8669 19.6667 20.6669 19.1333C21.3335 18.7333 21.5335 17.8667 21.1335 17.2C20.7335 16.5333 19.8669 16.3333 19.2002 16.7333C17.2669 17.9333 14.7335 17.9333 12.8002 16.7333C12.1335 16.3333 11.2669 16.5333 10.8669 17.2C10.4669 17.8667 10.6669 18.7333 11.3335 19.1333C12.2002 19.6667 13.1335 20.0667 14.0669 20.2667L11.4002 22.9333C10.8669 23.4667 10.8669 24.3333 11.4002 24.9333C11.6669 25.2 12.0002 25.3333 12.4002 25.3333C12.7335 25.3333 13.1335 25.2 13.4002 24.9333L16.0002 22.3333L18.6002 24.9333C19.1335 25.4667 20.0002 25.4667 20.6002 24.9333C21.1335 24.4 21.1335 23.5333 20.6002 22.9333L17.9335 20.2667ZM16.0002 6.66667C13.4002 6.66667 11.3335 8.73334 11.3335 11.3333C11.3335 13.9333 13.4002 16 16.0002 16C18.6002 16 20.6669 13.9333 20.6669 11.3333C20.6669 8.73334 18.6002 6.66667 16.0002 6.66667ZM16.0002 13.3333C14.8669 13.3333 14.0002 12.4667 14.0002 11.3333C14.0002 10.2 14.8669 9.33334 16.0002 9.33334C17.1335 9.33334 18.0002 10.2 18.0002 11.3333C18.0002 12.4667 17.1335 13.3333 16.0002 13.3333Z" fill="white")
                            td
                              svg(width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg")
                                path(d="M28 24.6667C28 26.508 26.508 28 24.6667 28H7.33333C5.49267 28 4 26.508 4 24.6667V7.33333C4 5.492 5.49267 4 7.33333 4H24.6667C26.508 4 28 5.492 28 7.33333V24.6667Z" fill="#1976D2")
                                path(d="M23.958 12.0273C23.9887 11.9267 24.0033 11.8333 23.9993 11.75C23.9893 11.5087 23.8233 11.3333 23.4327 11.3333H21.6873C21.2467 11.3333 21.0433 11.6 20.9247 11.8673C20.9247 11.8673 19.8367 14.1067 18.5827 15.5833C18.176 16.0107 17.9693 16 17.7493 16C17.6313 16 17.3333 15.8573 17.3333 15.466V12.0093C17.3333 11.5467 17.218 11.3333 16.8453 11.3333H13.746C13.4747 11.3333 13.3333 11.5467 13.3333 11.7607C13.3333 12.2053 13.932 12.312 14 13.558V15.9733C14 16.56 13.898 16.6667 13.678 16.6667C13.0847 16.6667 11.9167 14.6667 11.1347 12.0453C10.9653 11.5293 10.796 11.3333 10.3553 11.3333H8.59333C8.08467 11.3333 8 11.5827 8 11.8493C8 12.33 8.4 14.9287 10.5833 17.9167C12.1667 20.0833 14.2527 21.3333 16.0993 21.3333C17.218 21.3333 17.3327 21.0487 17.3327 20.604V18.6227C17.3333 18.0887 17.4553 18 17.8113 18C18.0653 18 18.5833 18.1667 19.5833 19.3333C20.7367 20.6787 20.946 21.3333 21.6073 21.3333H23.3527C23.758 21.3333 23.9907 21.1633 24 20.8333C24.002 20.7493 23.99 20.6553 23.9627 20.5507C23.8333 20.1667 23.24 19.228 22.5 18.3333C22.09 17.838 21.6853 17.3473 21.4993 17.0807C21.3747 16.9067 21.3273 16.784 21.3333 16.6667C21.3393 16.5433 21.4033 16.426 21.4993 16.262C21.482 16.262 23.738 13.0947 23.958 12.0273Z" fill="white")
                    tr
                      td
                        p © 1988 — 2023, Университет «Синергия». Все права защищены.
</template>
  
<script setup lang="ts">
import { onMounted, computed } from 'vue'
import { useExpirements } from '../../composables'

const { actions, getters } = useExpirements()

const c1 = computed(() => {
  return getters?.ex1() || 0
})

const c2 = computed(() => {
  return getters?.ex2() || 0
})
</script>

<style lang="scss" scoped>

table {
  border-spacing: 0;
  tr {
    td {
      padding: 0;
    }
  }
}
</style>